<?php

$lots_data = [
    [
        'id' => '1',
        'name' => '2014 Rossingnol District Snowboard',
        'category' => 'Доски и лыжи',
        'cost' => 10999,
        'image' => 'img/lot-1.jpg',
        'lot_image' => 'img/lot-image.jpg',
        'description' => 'Легкий маневренный сноуборд, готовый дать жару в любом парке, растопив
                снег мощным щелчкомои четкими дугами. Стекловолокно Bi-Ax, уложенное в двух направлениях, наделяет этот
                снаряд отличной гибкостью и отзывчивостью, а симметричная геометрия в сочетании с классическим прогибом
                кэмбер позволит уверенно держать высокие скорости. А если к концу катального дня сил совсем не останется,
                просто посмотрите на Вашу доску и улыбнитесь, крутая графика от Шона Кливера еще никого не оставляла
                равнодушным.',
        'min_cost' => 10999,
    ],
    [
        'id' => 2,
        'name' => 'DC Ply Mens 2016/2017 Snowboard',
        'category' => 'Доски и лыжи',
        'cost' => 159999,
        'image' => 'img/lot-2.jpg',
        'lot_image' => 'img/lot-image.jpg',
        'description' => 'Легкий маневренный сноуборд, готовый дать жару в любом парке, растопив
                снег мощным щелчкомои четкими дугами. Стекловолокно Bi-Ax, уложенное в двух направлениях, наделяет этот
                снаряд отличной гибкостью и отзывчивостью, а симметричная геометрия в сочетании с классическим прогибом
                кэмбер позволит уверенно держать высокие скорости. А если к концу катального дня сил совсем не останется,
                просто посмотрите на Вашу доску и улыбнитесь, крутая графика от Шона Кливера еще никого не оставляла
                равнодушным.',
        'min_cost' => 10999,
    ],
    [
        'id' => 3,
        'name' => 'Крепления Union Contact Pro 2015 года размер L/XL',
        'category' => 'Крепления',
        'cost' => 8000,
        'image' => 'img/lot-3.jpg',
        'lot_image' => 'img/lot-image.jpg',
        'description' => 'Легкий маневренный сноуборд, готовый дать жару в любом парке, растопив
                снег мощным щелчкомои четкими дугами. Стекловолокно Bi-Ax, уложенное в двух направлениях, наделяет этот
                снаряд отличной гибкостью и отзывчивостью, а симметричная геометрия в сочетании с классическим прогибом
                кэмбер позволит уверенно держать высокие скорости. А если к концу катального дня сил совсем не останется,
                просто посмотрите на Вашу доску и улыбнитесь, крутая графика от Шона Кливера еще никого не оставляла
                равнодушным.',
        'min_cost' => 10999,
    ],
    [
        'id' => 4,
        'name' => 'Ботинки для сноуборда DC Multiny Charocal',
        'category' => 'Ботинки',
        'cost' => 10999,
        'image' => 'img/lot-4.jpg',
        'lot_image' => 'img/lot-image.jpg',
        'description' => 'Легкий маневренный сноуборд, готовый дать жару в любом парке, растопив
                снег мощным щелчкомои четкими дугами. Стекловолокно Bi-Ax, уложенное в двух направлениях, наделяет этот
                снаряд отличной гибкостью и отзывчивостью, а симметричная геометрия в сочетании с классическим прогибом
                кэмбер позволит уверенно держать высокие скорости. А если к концу катального дня сил совсем не останется,
                просто посмотрите на Вашу доску и улыбнитесь, крутая графика от Шона Кливера еще никого не оставляла
                равнодушным.',
        'min_cost' => 10999,
    ],
    [
        'id' => 5,
        'name' => 'Куртка для сноубордистов DC Mutiny Charocal',
        'category' => 'Одежда',
        'cost' => 750000000,
        'image' => 'img/lot-5.jpg',
        'lot_image' => 'img/lot-image.jpg',
        'description' => 'Легкий маневренный сноуборд, готовый дать жару в любом парке, растопив
                снег мощным щелчкомои четкими дугами. Стекловолокно Bi-Ax, уложенное в двух направлениях, наделяет этот
                снаряд отличной гибкостью и отзывчивостью, а симметричная геометрия в сочетании с классическим прогибом
                кэмбер позволит уверенно держать высокие скорости. А если к концу катального дня сил совсем не останется,
                просто посмотрите на Вашу доску и улыбнитесь, крутая графика от Шона Кливера еще никого не оставляла
                равнодушным.',
        'min_cost' => 10999,
    ],
    [
        'id' => 6,
        'name' => 'Маска Oakley Canopy',
        'category' => 'Разное',
        'cost' => 5400,
        'image' => 'img/lot-6.jpg',
        'lot_image' => 'img/lot-image.jpg',
        'description' => 'Легкий маневренный сноуборд, готовый дать жару в любом парке, растопив
                снег мощным щелчкомои четкими дугами. Стекловолокно Bi-Ax, уложенное в двух направлениях, наделяет этот
                снаряд отличной гибкостью и отзывчивостью, а симметричная геометрия в сочетании с классическим прогибом
                кэмбер позволит уверенно держать высокие скорости. А если к концу катального дня сил совсем не останется,
                просто посмотрите на Вашу доску и улыбнитесь, крутая графика от Шона Кливера еще никого не оставляла
                равнодушным.',
        'min_cost' => 10999
    ],
];

const SEC_PER_DAY = 60 * 60 * 24;
foreach ($lots_data as &$lot) {
    $lot['endtime'] = strtotime('tomorrow');
}


